{
    "title": "Work Philosophy",
    "text": "Frontend Web Developer:  friendly, reliable, future-focused & committed to delivering as part of a team or independently. Holistic, advanced, understanding of the challenges, factors that play a part in website development. Dedicated to innovation, problem-solving and learning.",
    "experience": {
        "title": "Experience",
        "text": [
            "At Blast Radius, I workedas an Interface Developer as part of a team, just before their acquisition by WPP group. My portfolio included clients such as [...]",
            "In 2014, I branched out to create the small, but mighty, corporation Oakenfold Enterprises Ltd. Since, I have collaborated and lead on variety of projects, with all kinds of impact [...]",
            "Here are some of the things I bring to the table:",
            [
                "Success  working remotely with early stage startups (in the USA)",
                "Developing and refining features in consultation with project founders and stakeholders",
                "Contributing features and cleaning up pre-existing codebases",
                "Delivering sites from alpha > beta > production.",
                "Introducing new technologies [...]"
            ],
            "I am always learning something new. Currently, I am passionate about <a href='//reactjs.org' target='_blank' rel='noopener'>React</a>, <a href='#web-performance'>web page performance</a>, and <a href='#wcag'>accessibility.</a> "
        ]
    },
    "spa": {
        "title": "Single Page Applications",
        "problem": [
            "The baseline expectations for a website are constantly changing.",
            "The user interface and experience of a website is an extension of the branding for a business, service, or product.",
            "Web based Single Page Applications are sophisticated and seemless experiences that feel like native applications.",
            "It can differentiate a company from it's competitors.",
        ],
        "text": [
            "Developed and refined the frontend code for Fyndit.com.",
            "Including...",
            [
                "Html markup.",
                "CSS styling.",
                "Searched business locations using Google Places and Foursquare. Results plotted to Google Maps.",
                "CSS class name '.js-*' reserved for scripting purposes. No .css styles attached to classes. Useful for: initializing components, setting state of elements, event binding. <a href='#'>Example.</a>",
                "User registration and login flows. Includes support for authenticating via Google, Facebook and Twitter.",
                "Delayed loading of 3rd party libraries until they were on the page or had been interacted with by the user. <a href='#'>Example.</a>",
                "Search and Autocomplete features.",
                "The backend/server was setup to cache static elements (via redis). \"Rehydrated\" interface state via an inline .js {obj} (e.g: \"the user has liked this item so update it's styling\").  <a href='#'>Example.</a>",
                "Routed xhr requests through a central functon. Useful for adding pre and/or post request scripting. <a href='#'>Example.</a>",
                "App Shell setup: a site frame where new content is inserted into a dedicated div. <a href='#'>Example.</a>",
                "Used SVG symbols. Great for image reuse in multiple locations.  <a href='#'>Example.</a>",
                ["Code splitting at a component level.",
                    [
                        "2 main javascript bundles: core application scripting and related library files. The rest is dynamically loaded.",
                        "Created a system where components register their selectors with a function. When the dom is updated, it scans a div and calls any existing components."
                    ]
                ],
                "Cross-browser tested. Most features supported down to Internet Explorer 11."
            ]
        ]
    },
    "speed": {
        "title": "Web Performance",
        "text": [
            "How fast a site loads has a direct impact on conversion rates, visitor retention, and revenue.",
            "Researching, learning and implementing successful strategies in production. Including:"
        ]
    }
}